# Pandas

Three data structure - series, dataframes, panel
series - one dimensional 
dataframe - two dimensional
panel: 3d container of data

# Series

In [23]:
import pandas as pd
x = [3,4,5,6]
var = pd.Series(x, index = ['a', 's', 'd', 'f'], dtype = "float", name= "python")

print(var)
print(type(var))

a    3.0
s    4.0
d    5.0
f    6.0
Name: python, dtype: float64
<class 'pandas.core.series.Series'>

In [25]:
dic = {"name": ['python', 'c', 'c++', 'java'], "por": [12,13,14,15], "rank": [1,4,3,2]}
var1 = pd.Series(dic)
print(var1)

name    [python, c, c++, java]
por           [12, 13, 14, 15]
rank              [1, 4, 3, 2]
dtype: object

In [27]:
s = pd.Series(12)
print(s)

0    12
dtype: int64

In [30]:
s1 = pd.Series(12, index=[1,2,3,4,5,6,7])
s2 = pd.Series(6, index = [1,2,3,4])
print(s1)
print(s2)
print(s1+s2)

1    12
2    12
3    12
4    12
5    12
6    12
7    12
dtype: int64
1    6
2    6
3    6
4    6
dtype: int64
1    18.0
2    18.0
3    18.0
4    18.0
5     NaN
6     NaN
7     NaN
dtype: float64

# Dataframe

In [33]:
#with help of list
l = [1,2,3,4,5,6]
var = pd.DataFrame(l)
print(var)
print(type(var))

   0
0  1
1  2
2  3
3  4
4  5
5  6
<class 'pandas.core.frame.DataFrame'>

In [43]:
#making dataframe with help of dictionary
d = {"a":[1,2,3,4,5], "s":[1,2,3,4,7], 1: [1,2,3,4,5]}
var1 = pd.DataFrame(d)
print(var1)

#to access element at a[col][row]
print(var1["a"][4])
print(type(var1))

   a  s  1
0  1  1  1
1  2  2  2
2  3  3  3
3  4  4  4
4  5  7  5
5
<class 'pandas.core.frame.DataFrame'>

In [40]:
#how to get by column wise
d = {"a":[1,2,3,4,5], "s":[1,2,3,4,7], 1: [1,2,3,4,5]}
var1 = pd.DataFrame(d, columns = ["a", 1])
print(var1)
print(type(var))

   a  1
0  1  1
1  2  2
2  3  3
3  4  4
4  5  5
<class 'pandas.core.frame.DataFrame'>

In [42]:
#to change index
d = {"a":[1,2,3,4,5], "s":[1,2,3,4,7], 1: [1,2,3,4,5]}
var1 = pd.DataFrame(d, index= ["a", "s", "d", "f", "g"])
print(type(var1))
print(var1)

<class 'pandas.core.frame.DataFrame'>
   a  s  1
a  1  1  1
s  2  2  2
d  3  3  3
f  4  4  4
g  5  7  5

In [45]:
# to make dataframe from series
sr = { "s": pd.Series([1,2,3,4]), "r": pd.Series([1,2,5,8])}
var3 = pd.DataFrame(sr)

print(type(var3))
print(var3)

<class 'pandas.core.frame.DataFrame'>
   s  r
0  1  1
1  2  2
2  3  5
3  4  8

# Arithmetic operations

In [47]:
var = pd.DataFrame({"A": [1,2,3,4], "B": [5,6,7,8]})
var

   A  B
0  1  5
1  2  6
2  3  7
3  4  8

To add, subtract, multiply or divide two columns of dataframe

In [52]:
var["C"] = var["A"] + var["B"]
var["D"] = var["A"] - var["B"]
var ["E"] = var["A"]/var["B"]
var

   A  B   C  D         E
0  1  5   6 -4  0.200000
1  2  6   8 -4  0.333333
2  3  7  10 -4  0.428571
3  4  8  12 -4  0.500000

In [54]:
var1 = pd.DataFrame({"A":[10,20,30,40], "B": [15,16,17,18]})
var1

    A   B
0  10  15
1  20  16
2  30  17
3  40  18

In [57]:
var1["Python"] = var1["A"] <= 20
var1

    A   B  Python
0  10  15    True
1  20  16    True
2  30  17   False
3  40  18   False

# Delete and insert data

In [74]:
var3 = pd.DataFrame({"A": [1,2,3,4,5], "B":[9,8,7,6,5]})
var3

   A  B
0  1  9
1  2  8
2  3  7
3  4  6
4  5  5

parameter in insert - index number, name, what

In [75]:
var3.insert(1, "python", var["A"])
var3

   A  python  B
0  1       1  9
1  2       2  8
2  3       3  7
3  4       4  6
4  5       5  5

Delete data

In [76]:
var4 = var3.pop("B")
var4

0    9
1    8
2    7
3    6
4    5
Name: B, dtype: int64

In [77]:
del var3["A"]
var3

   python
0       1
1       2
2       3
3       4
4       5